# #### Завдання 1
# Обчислити площу трикутника, коли відома сторона та проведена висота до неї
a = int(input())
h = int(input())
print('S =', 0.5*(a*h))


# #### Завдання 2
# Дано трицифрове число. Виведіть окремо кожну цифру числа та суми цифр число
# Реалізуйте завдання двома способами (використовуючи стрічки та оператори `%`, `//`)
N = input()
print(N[0], N[1], N[2])
print('Sum =', int(N[0]) + int(N[1]) + int(N[2]))

N = int(input())
one = N//100
two = (N%100)//10
three = N - (one*100 + two*10)
print(one, two, three)
print('Sum =', one + two + three)


# #### Завдання 3
# Дано речення (стрічка).
# * Розбийте речення по словах і помістіть їх у список.
# * Виведіть кількість слів у речені.
# * Утворіть нове речення, що складається з першого та останнього слова із початкового речення.
nce = 'My favourite tutor in academy is Ihor'
words = sentence.split()    # list of words
print(len(words))           # number of words
newSentence = words[0] + ' ' + words[len(words)-1]  # First and last words
print(newSentence)


# #### Завдання 4
# Перевірте, чи справджується формула: $$ sin^2x + cos^2x = 1$$
# Напишіть код, що реалізує цю формулу. Нагадую, що тригонометричні функції приймають аргументи в радіанній мірі
import math
x = int(input())
radX = (x*3.1416)/180
fin = math.sin(radX**2) + math.cos(radX**2)
print(int(fin))


# #### Завдання 5
# Напишіть програму для обчислення коренів квадратного рівняння.
# Нагадую, що `n`-го степеня має `n` коренів. (Корені можуть бути комплексні)
a = int(input())
b = int(input())
c = int(input())
D = b**2 - 4*a*c
if D == 0:
    x = -b/(2*a)
    print(x)
else:
    x1 = (-b + D**0.5)/(2*a)
    x2 = (-b - D**0.5)/(2*a)
    print(x1)
    print(x2)


# #### Завдання 6
# Напишіть програму, що виводить речення: <i>"Діаметр планети `Planet` дорівнює` Diament`"</i>,
# де `Planet` та `Diament` вводить користувач
Planet = input('Введите навание планеты')
Diament = int(input())
print(f'Діаметр планети {Planet} дорівнює {Diament}')
